2018/c-pointer.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-08-12 周日 11:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C 语言指针和数组</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">C 语言指针和数组</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf59d6b8">1. 简介</a></li>
<li><a href="#org82535d9">2. 基本对象</a></li>
<li><a href="#org6dc2e0d">3. 指针的值</a></li>
<li><a href="#orgcabeaa2">4. 指针运算</a></li>
<li><a href="#org3a5ee10">5. 指针类型</a></li>
<li><a href="#org45c4950">6. 指针参数</a></li>
<li><a href="#orgdc8e4ed">7. 函数指针</a></li>
<li><a href="#org8f912b7">8. 数组</a></li>
<li><a href="#org0498f63">9. 指针数组和数组指针</a></li>
<li><a href="#org4095f04">10. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf59d6b8" class="outline-2">
<h2 id="orgf59d6b8"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
C 语言是一门很重要的语言， 即使你不会使用 C 语言进行程序开发， 但是学习了解
C 语言依然是一件很有必要的事情。
</p>

<p>
因为， 你学的是计算机 ！
</p>

<p>
而指针和数组， 算是 C 语言中比较难以理解的两个东西了。
</p>

<p>
学 C 开始到现在， 快要两年了， 在指针和数组上遇到过不少坑， 也见识过不少奇淫技巧，
到了现在， 感觉可以对两者进行一定的总结了。
</p>

<p>
<b>NOTE:</b> 本篇博客主要内容是对指针和数组的理解与总结， 语法涉及的不多
</p>
</div>
</div>

<div id="outline-container-org82535d9" class="outline-2">
<h2 id="org82535d9"><span class="section-number-2">2</span> 基本对象</h2>
<div class="outline-text-2" id="text-2">
<p>
为了更好的理解 <b>指针和数组</b>, 需要引入两个基本对象：
</p>
<ul class="org-ul">
<li><b>内存地址</b>: 内存中的一个地址， 如： <code>0xFFFFFFFF</code></li>
<li><b>地址的值</b>: 内存中一个地址保存的值， 如： 地址 <code>0xFFFFFFFF</code> 的值为 <code>0x01234567</code></li>
</ul>
</div>
</div>

<div id="outline-container-org6dc2e0d" class="outline-2">
<h2 id="org6dc2e0d"><span class="section-number-2">3</span> 指针的值</h2>
<div class="outline-text-2" id="text-3">
<p>
学习指针的过程中， 一定要分清楚的两个值是： <b>指针地址</b> 和 <b>指针的值</b>.
</p>

<p>
这是容易混淆的两个值， 因为这两个值都是 <b>内存地址</b>.
</p>

<p>
但是， 在使用指针的时候需要分清楚这两个值的关系： <b>指针地址</b> 的值是 <b>指针的值</b>.
</p>

<p>
这是指针比较特殊的一点， 即： 所有的指针操作都是围绕着 <b>内存地址</b> 进行的。
</p>

<p>
这两个概念需要分清楚的原因是为了理解 <b>指针</b> 与 <b>其他类型</b> 的区别：
</p>
<ul class="org-ul">
<li><b>指针</b> 和 <b>其他类型</b> 没有实质性的区别</li>
<li>两者的主要区别体现在 <b>保存的值</b> 与 <b>指针运算</b> 上</li>
</ul>
</div>
</div>

<div id="outline-container-orgcabeaa2" class="outline-2">
<h2 id="orgcabeaa2"><span class="section-number-2">4</span> 指针运算</h2>
<div class="outline-text-2" id="text-4">
<p>
和其他类型不同， 由于指针保存的值是 <b>内存地址</b>, 因此指针运算的直接操作对象就是 <b>内存地址</b>.
</p>

<p>
C 语言通过操作符 <code>&amp;</code> 和 <code>*</code> 来产生 <b>指针</b> 和 <b>间接引用指针</b>.
</p>

<p>
<b>指针</b>, 是类似于 <code>&amp;var</code> 产生的值， 代表 <code>var</code> 的 <b>内存地址</b>.
</p>

<p>
<b>间接引用指针</b>, 类似于 <code>*ptr</code> 的使用， 操作修改 <b>指针的值(内存地址)</b> 的 <b>值(地址的值)</b>.
</p>

<p>
因此， 表达式 <code>*&amp;Expr</code> 和 <code>Expr</code> 是等价的， 都是操作 <code>Expr</code> 的值。
</p>
</div>
</div>

<div id="outline-container-org3a5ee10" class="outline-2">
<h2 id="org3a5ee10"><span class="section-number-2">5</span> 指针类型</h2>
<div class="outline-text-2" id="text-5">
<p>
由于所有的指针保存的值都是一个 <b>内存地址</b>, 因此所有指针变量的大小都是一样的， 等于操作系统的 <b>地址宽度</b>.
</p>

<p>
这时， 为了区分不同的 <b>指针</b>, <b>指针类型</b> 的作用便体现出来了。
</p>

<p>
首先， 需要明白的一点是： 单个地址能够保存的数据大小是 <b>一个字节</b>.
</p>

<p>
然而， 除了 <code>char</code>, 其他大多数类型的变量的大小都大于一个字节， 因此这些类型
的变量会占据 <b>连续</b> 的几个内存来保存自身的值。
</p>

<p>
自身的 <b>内存地址</b> 仅为这几个 <b>连续</b> 内存地址的 <b>首地址</b>.
</p>

<p>
同样， <b>指针</b> 保存的值就是这个 <b>首地址</b>.
</p>

<p>
<b>指针类型</b> 的作用就是确定这个 <b>连续</b> 的内存地址究竟有多少个。
</p>

<p>
比如， <code>int*</code> 类型的指针就表示这个连续的内存地址有 <code>4</code> 个。
</p>

<p>
同时， <b>指针</b> 加减一个 <b>整数</b> 的时候， 实际加减的值为 <b>整数</b> 和 <b>类型大小</b> 的乘积。
</p>

<p>
而 <b>指针</b> 减 <b>指针</b> 的时候， 得出的结果会 <b>除</b> 以 <b>类型大小</b>.
</p>

<p>
另外， 需要注意的一点是： 转换指针类型不会改变 <b>指针的值</b>.
</p>
</div>
</div>

<div id="outline-container-org45c4950" class="outline-2">
<h2 id="org45c4950"><span class="section-number-2">6</span> 指针参数</h2>
<div class="outline-text-2" id="text-6">
<p>
当函数的参数是一个指针的时候， 传参时的行为和其他类型的变量 <b>没有区别</b>.
</p>

<p>
都是传递 <b>变量的值</b>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">test</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">ptr</span>) {
  printf(<span style="font-style: italic;">"%p %p\n"</span>, &amp;ptr, ptr);
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>) {
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">var</span> = 10;
  <span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">ptr</span> = &amp;var;

  test(ptr);
  printf(<span style="font-style: italic;">"%p %p\n"</span>, &amp;ptr, ptr);

  <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>

<p>
以上代码的执行结果为：
</p>
<pre class="example">
000000000022FE20 000000000022FE4C
000000000022FE40 000000000022FE4C
</pre>

<p>
可以看到， <b>指针地址</b> 是不一样的， 相同的是 <b>指针的值</b>.
</p>

<p>
函数内部的修改能够反馈到函数的调用者的原因仅仅是两者
操作的 <b>内存地址</b> 相同而已。
</p>
</div>
</div>

<div id="outline-container-orgdc8e4ed" class="outline-2">
<h2 id="orgdc8e4ed"><span class="section-number-2">7</span> 函数指针</h2>
<div class="outline-text-2" id="text-7">
<p>
如果你学过操作系统， 那么应该就知道， <b>函数</b> 只是内存中的一个 <b>指令块</b>.
</p>

<p>
调用函数的过程就是将要运行的指令转移到该 <b>指令块</b>.
</p>

<p>
C 语言中， <b>函数名</b> 相当于该 <b>指令块</b> 的首地址。
</p>

<p>
既然是地址， 那么就可以用 <b>指针</b> 来保存。
</p>

<p>
因此可以用下面的方式来定义函数指针：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">func</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">b</span>) {
  <span style="font-weight: bold;">return</span> a + b;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> (*fptr)(<span style="font-weight: bold; text-decoration: underline;">int</span>, <span style="font-weight: bold; text-decoration: underline;">int</span>) = func;
</pre>
</div>

<p>
其中， <code>int</code> 表示函数的返回值类型为 <code>int</code>, <code>(*fptr)()</code> 表示这是一个函数指针。
</p>

<p>
括号内部为参数类型。
</p>

<p>
由于 <code>func</code> 就代表了函数地址， 因此可以省略操作符 <code>&amp;</code>.
</p>

<p>
当然， 这样也是等价操作：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> (*fptr)(<span style="font-weight: bold; text-decoration: underline;">int</span>, <span style="font-weight: bold; text-decoration: underline;">int</span>) = &amp;func;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f912b7" class="outline-2">
<h2 id="org8f912b7"><span class="section-number-2">8</span> 数组</h2>
<div class="outline-text-2" id="text-8">
<p>
在 C 语言中， 数组和指针的关系密切， 主要原因就是 <b>数组名</b> 相当于指向数组第一个元素
地址的 <b>指针</b>.
</p>

<p>
但是这个指针很特殊：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>) {
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">arr</span>[4] = {1, 2, 3, 4};
  printf(<span style="font-style: italic;">"%p %p"</span>, &amp;arr, arr);
  <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>

<p>
上述代码的输出为：
</p>
<pre class="example">
000000000022FE40 000000000022FE40

</pre>

<p>
可以看到， <code>&amp;arr</code> 和 <code>arr</code> 的值是相同的。
</p>

<p>
也就是说， <b>数组名</b> 相当于 <b>指针地址</b> 和 <b>指针的值</b> 相同的 <b>指针</b>.
</p>

<p>
但是， <code>&amp;arr</code> 的 <code>arr</code> 并不相同：
</p>
<ul class="org-ul">
<li><code>&amp;arr</code> 产生的是 <b>数组类型</b> 的指针， <code>&amp;arr + 1</code> 的结果是 <code>&amp;arr</code> 的值和 <b>数组大小</b> 的和</li>
<li><code>arr</code> 相当于指向 <b>数组</b> 第一个元素的 <b>指针</b>, 指针类型就是 <b>元素类型</b>.</li>
</ul>

<p>
同时， 数组取值操作 <code>arr[i]</code> 等价于 <code>*(arr + i)</code>. 因此在使用指针操作数组的时候， 不要忘了
符号 <code>*</code>.
</p>

<p>
当然， 如果不想使用 <code>*ptr</code> 的方式来使用指针， <code>ptr[0]</code> 的结果也是相同的， 当然， 不推荐。
</p>

<p>
另： <code>arr[i]</code> 和 <code>i[arr]</code> 没有区别。
</p>
</div>
</div>

<div id="outline-container-org0498f63" class="outline-2">
<h2 id="org0498f63"><span class="section-number-2">9</span> 指针数组和数组指针</h2>
<div class="outline-text-2" id="text-9">
<p>
指针数组和数组指针是容易犯错的一个地方， 简单梳理一下：
</p>
<ul class="org-ul">
<li>指针数组是一个数组， 这个数组保存的元素的类型是指针</li>
<li>数组指针是一个指针， 这个指针指向的对象是一个数组</li>
</ul>

<p>
通常来说， 指针数组使用如下方式声明：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">prt_arr</span>[4];
</pre>
</div>

<p>
声明一个数组 <code>ptr_arr</code>, 保存的元素类型为 <code>int*</code>.
</p>

<p>
而数组指针使用下面的方式声明：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> (*arr_ptr)[3];
</pre>
</div>

<p>
声明一个指针 <code>arr_ptr</code>, 指向的对象是一个拥有三个元素的 <b>数组</b>.
</p>
</div>
</div>

<div id="outline-container-org4095f04" class="outline-2">
<h2 id="org4095f04"><span class="section-number-2">10</span> 参考链接</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><a href="http://www.runoob.com/w3cnote/c-pointer-detail.html">C 指针详解</a></li>
<li><a href="http://home.netcom.com/~tjensen/ptr/pointers.htm">A TUTORIAL ON POINTERS AND ARRAYS IN C</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
           <div id="disqus_thread"></div>
           <script type="text/javascript">
             var disqus_shortname = 'rgb-24bit';
             (function() {
               var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
               dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
               (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
             })();
           </script>
</div>
</body>
</html>
